html/20231126T001334--raspberrypi-first-setup__raspberrypi.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://arvydasg.github.io/devnotes/html/rss.xml"
      title="RSS feed for https://arvydasg.github.io/devnotes/html">
<title>raspberrypi first setup</title>
<meta name="author" content="Arvydas Gasparavicius">
<meta name="referrer" content="no-referrer">
<meta name="viewport" content="initial-scale=1,width=device-width,minimum-scale=1">
<link rel="stylesheet" href="../static/style.css"/>
<link rel="icon" href="../static/ag.ico">
</head>
<body>
<div id="preamble" class="status"><br>preamble here yo</br></div>
<div id="content">
<div class="post-date">16 Dec 2023</div><h1 class="post-title"><a href="https://arvydasg.github.io/devnotes/html/20231126T001334--raspberrypi-first-setup__raspberrypi.html">raspberrypi first setup</a></h1>
<p>
Ramiausiai irasaiu i sd kortele is windowsu raspberry pi os.
</p>

<p>
ijungiau vncviewer, ijungiau ssh, 'ping raspberrypi' in terminal 0 shows me I
am connected. teo marsrutizatoriaus valdymo skydelis rodo, kad raspberrypi is
connected - pasaka.
</p>

<p>
prisijunk su ssh
</p>

<div class="org-src-container">
<pre class="src src-bash">ssh arvypi@192.1xx.1.xxx
</pre>
</div>

<p>
pass &lt;default dvi raides&gt; ir as viduj!
</p>

<p>
Install vncviewer ir krc daryk <code>ifconfig</code> inside raspberry ir pamatysi ip - su
juo pasijunk per vnc. easy, perfect, done.
</p>

<p>
<code>raspi-config</code> = pamatysi settingsus
</p>
<div class="taglist"><a href="https://arvydasg.github.io/devnotes/html/tags.html">Tags</a>: <a href="https://arvydasg.github.io/devnotes/html/tag-raspberrypi.html">raspberrypi</a> </div></div>
<div id="postamble" class="status"><br>postamble in he house</br></div>
</body>
</html>
